{"class_name": "Model", "config": {"name": "model_3", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"sparse": false, "batch_input_shape": [null, null, 61], "name": "input_2", "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_3", "config": {"sparse": false, "batch_input_shape": [null, 256], "name": "input_3", "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_4", "config": {"sparse": false, "batch_input_shape": [null, 256], "name": "input_4", "dtype": "float32"}}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["input_3", 0, 0, {}], ["input_4", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_2", "config": {"recurrent_regularizer": null, "units": 256, "recurrent_dropout": 0.0, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": true, "name": "lstm_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "implementation": 1, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "trainable": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0}}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"bias_constraint": null, "bias_regularizer": null, "units": 61, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null}}], "output_layers": [["dense_1", 0, 0], ["lstm_2", 0, 1], ["lstm_2", 0, 2]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}