{"class_name": "Model", "config": {"name": "model_2", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, null, 62], "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_1", "config": {"recurrent_regularizer": null, "units": 256, "recurrent_dropout": 0.0, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": true, "name": "lstm_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "implementation": 1, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "trainable": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0}}], "output_layers": [["lstm_1", 0, 1], ["lstm_1", 0, 2]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}